Config/Enums/ВидыКБК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКБК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>гКБК</Name>
					<Comment>Глава по БК</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КРБ</Name>
					<Comment>Классификация расходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КДБ</Name>
					<Comment>Классификация доходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КИФ</Name>
					<Comment>Классификация источников финансирования дефицита бюджетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУИБУ</Name>
					<Comment>Для АУ и БУ начиная с 01.01.2017</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОКП</Name>
					<Comment>Код по общероссийскому классификатору продукции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодРаспределенияСтоимостиПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыРаспределенияСтоимостиПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСпецификацияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment> Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожетСодержатьДрагМатериалы</Name>
					<Comment>Содержание драг. материалов будет определено после списания и утилизации.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляЧекаККМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроизводственнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроизводственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходноеСырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМаркируемойПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркируемойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаНоменклатурнойКлассификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоКТРУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектСПрослеживаемымиТоварами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрослеживаемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесПоСертификатуТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>11</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьКлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключитьВСоставВнеоборотныхАктивов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДополнительное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодGTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзготовительОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЕКПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиныйКодификаторПредметовСнабжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРаздел7ДекларацииНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыОперацийРаздела7ДекларацииПоНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDНоменклатурыОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияПрослеживаемости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрослеживаемыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектСПрослеживаемымиТоварами</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ДенежныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДенежныеДокументы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыДенежныхДокументов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonForms/ФормаОбъектыЗакупкиПоГосКонтрактуИзЕИС/Ext/Form/Module.bsl
&НаКлиенте
Перем ПеренестиВДокумент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнениеСведенийСправочника = Ложь;
	Если Параметры.Свойство("ЗаполнениеСведенийСправочника") Тогда
		ЗаполнениеСведенийСправочника = Параметры.ЗаполнениеСведенийСправочника;
	КонецЕсли;
	
	Организация = Параметры.Организация;
	Контрагент = Параметры.Контрагент;
	Договор = Параметры.Договор;
	ДатаДокумента = Параметры.ДатаДокумента;
	УчетПредметаДоговора = Ложь;
	Если ЗначениеЗаполнено(Договор) Тогда
		УчетПредметаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "УчетПредметаДоговора"); 
	КонецЕсли;

	Если ЗаполнениеСведенийСправочника Тогда
		ГосударственныйКонтрактЕИС = Параметры.ГосКонтракт;
		УчетПредметаДоговора = Истина;
	Иначе
		ИФО = Параметры.ИФО;
		ЕстьПодразделение = Параметры.ЕстьПодразделение;
		ЛицевойСчет = Параметры.ЛицевойСчет;
		ВалютаДокумента = Параметры.ВалютаДокумента;
		ЭтоБюджетополучатель = Параметры.ЭтоБюджетополучатель;
		
		УстановитьПараметрыВыбораЭлементов();
		
		ГосударственныйКонтрактЕИС = ЭлектронноеАктированиеЕИС.НайтиГосударственныйКонтрактПоВладельцу(Договор);
	КонецЕсли;	

	ЗаполнитьДанныеГосКонтракта();
	
	НастройкаИнтерфейсаФормы();
	УстановитьВидимостьПоСведениямИзЕИС();
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектыЗакупкиПоКонтрактуЕИС(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ПеренестиВДокумент = Истина Тогда
		АдресДанныхЗаполненияОбязательствВХранилище = ПоместитьДанныеЗаполненияРегистрацииОбязательствВХранилище();
		Структура = Новый Структура("АдресЗаполнениеДанныхИзЕИСВХранилище", АдресДанныхЗаполненияОбязательствВХранилище);
		ПеренестиВДокумент = Истина;
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент <> Истина И Модифицированность Тогда
	
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр("ru = 'Данные для заполнения изменены, но не перенесен в документ.
			|
			|Перенести?'"), РежимДиалогаВопрос.ДаНетОтмена);
			
		Отказ = Истина;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВДокумент(Команда)

	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	ПараметрыФормыСозданияНоменклатуры = Новый Структура;
	
	ТекущиеДанныеНоменклатуры = Элементы.ОбъектыЗакупкиПоКонтрактуЕИС.ТекущиеДанные;
	Если НЕ ТекущиеДанныеНоменклатуры = Неопределено Тогда 
		НаборНоменклатурыКонтрагентов = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента();
		
		ТипНоменклатурыФНС = ПредопределенноеЗначение("Перечисление.ТипыНоменклатурыФНС.ПустаяСсылка");
		Если ТекущиеДанныеНоменклатуры.ЭтоРаботаИлиУслуга Тогда
			ТипНоменклатурыФНС = ПредопределенноеЗначение("Перечисление.ТипыНоменклатурыФНС.Услуга");
		Иначе
			ТипНоменклатурыФНС = ПредопределенноеЗначение("Перечисление.ТипыНоменклатурыФНС.Имущество");
		КонецЕсли;	
		ПараметрыФормыСозданияНоменклатуры.Вставить("НаборНоменклатурыКонтрагентов", НаборНоменклатурыКонтрагентов);
		ПараметрыФормыСозданияНоменклатуры.Вставить("Организация", Организация); 
		ПараметрыФормыСозданияНоменклатуры.Вставить("ТипНоменклатурыФНС", ТипНоменклатурыФНС); 
		ПараметрыФормыСозданияНоменклатуры.Вставить("ЕдиницаИзмеренияКод", ТекущиеДанныеНоменклатуры.ЕдиницаИзмеренияКод); 
		ПараметрыФормыСозданияНоменклатуры.Вставить("НаименованиеНоменклатуры", ТекущиеДанныеНоменклатуры.НаименованиеОбъектаЗакупки); 
		ПараметрыФормыСозданияНоменклатуры.Вставить("СтранаПроисхождения", ТекущиеДанныеНоменклатуры.СтранаПроисхождения); 
		Если ЗначениеЗаполнено(ТекущиеДанныеНоменклатуры.ОКП) Тогда
			ПараметрыФормыСозданияНоменклатуры.Вставить("ОКП", ТекущиеДанныеНоменклатуры.ОКПД); 
		КонецЕсли;	
		Если ЗначениеЗаполнено(ТекущиеДанныеНоменклатуры.ЕдиницаИзмерения) Тогда
			ПараметрыФормыСозданияНоменклатуры.Вставить("ЕдиницаИзмерения", ТекущиеДанныеНоменклатуры.ЕдиницаИзмерения); 
		КонецЕсли;	
		
		ОткрытьФорму("Обработка.СопоставлениеНоменклатурыБЭД.Форма.ФормаВыбораПараметровНоменклатурыДляБГУ", ПараметрыФормыСозданияНоменклатуры, Элементы.ОбъектыЗакупкиПоКонтрактуЕИС);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрано ни одна строка из списка ""Объекты закупки"".'");
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуру(Команда)
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",,Элементы.ОбъектыЗакупкиПоКонтрактуЕИС);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОсновноеСредство(Команда)
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаВыбора",,Элементы.ОбъектыЗакупкиПоКонтрактуЕИС);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДенежныйДокумент(Команда)
	ОткрытьФорму("Справочник.ДенежныеДокументы.Форма.ФормаВыбора",,Элементы.ОбъектыЗакупкиПоКонтрактуЕИС);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыОбъектыЗакупкиПоКонтрактуЕИС

&НаКлиенте
Процедура ОбъектыЗакупкиПоКонтрактуЕИСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") 
		ИЛИ ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ОсновныеСредства")
		ИЛИ ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ДенежныеДокументы") Тогда
		МассивСтрок = Элементы.ОбъектыЗакупкиПоКонтрактуЕИС.ВыделенныеСтроки;
		Для Каждого ЭлМас Из МассивСтрок Цикл
			ТекСтр = ОбъектыЗакупкиПоКонтрактуЕИС.НайтиПоИдентификатору(ЭлМас);
			Если ТекСтр <> Неопределено Тогда
				ТекСтр.Номенклатура = ВыбранноеЗначение;
			КонецЕсли;
		КонецЦикла;
		ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектыЗакупкиПоКонтрактуЕИС(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыЗакупкиПоКонтрактуЕИСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.ОбъектыЗакупкиПоКонтрактуЕИС.ТекущиеДанные;
	ОбновитьТекстЗаголовковВСтрокеТаблицыОбъектыЗакупкиПоКонтрактуЕИС(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеГосКонтракта()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.НомерСтроки КАК НомерСтроки,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.ЕдиницаИзмерения КАК ЕдиницаИзмеренияКод,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.ЕдиницаИзмеренияНаименование КАК ЕдиницаИзмеренияНаименование,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.КодТовараДляЕИС КАК КодТовараДляЕИС,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.Количество КАК Количество,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.Наименование КАК НаименованиеОбъектаЗакупки,
	               |	ВЫБОР
	               |		КОГДА ГосударственныеКонтрактыЕИСОбъектыЗакупки.Сумма = 0
	               |			ТОГДА ГосударственныеКонтрактыЕИСОбъектыЗакупки.Цена
	               |		ИНАЧЕ ГосударственныеКонтрактыЕИСОбъектыЗакупки.Сумма
	               |	КОНЕЦ КАК Сумма,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.Идентификатор КАК Идентификатор,
	               |	ГосударственныеКонтрактыЕИСНоменклатураОбъектовЗакупки.Номенклатура КАК Номенклатура,
	               |	КлассификаторЕдиницИзмерения.Ссылка КАК ЕдиницаИзмерения,
	               |	ОбщероссийскийКлассификаторПродукции.Ссылка КАК ОКПД,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.КодТовараДляЕИС КАК ОКП,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.ЭтоЛекарственныйПрепарат КАК ЭтоЛекарственныйПрепарат,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.ЭтоМедицинскоеИзделие КАК ЭтоМедицинскоеИзделие,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.ЭтоРаботаИлиУслуга КАК ЭтоРаботаИлиУслуга,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.ЭтоПриобретениеЖилыхПомещений КАК ЭтоПриобретениеЖилыхПомещений,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.СтавкаНДС КАК СтавкаНДС,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.СтранаПроисхождения КАК СтранаПроисхождения
	               |ИЗ
	               |	Справочник.ГосударственныеКонтрактыЕИС.ОбъектыЗакупки КАК ГосударственныеКонтрактыЕИСОбъектыЗакупки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГосударственныеКонтрактыЕИС.НоменклатураОбъектовЗакупки КАК ГосударственныеКонтрактыЕИСНоменклатураОбъектовЗакупки
	               |		ПО ГосударственныеКонтрактыЕИСОбъектыЗакупки.Ссылка = ГосударственныеКонтрактыЕИСНоменклатураОбъектовЗакупки.Ссылка
	               |			И ГосударственныеКонтрактыЕИСОбъектыЗакупки.Идентификатор = ГосударственныеКонтрактыЕИСНоменклатураОбъектовЗакупки.Идентификатор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	               |		ПО ГосударственныеКонтрактыЕИСОбъектыЗакупки.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбщероссийскийКлассификаторПродукции КАК ОбщероссийскийКлассификаторПродукции
	               |		ПО ГосударственныеКонтрактыЕИСОбъектыЗакупки.КодТовараДляЕИС = ОбщероссийскийКлассификаторПродукции.Код
	               |ГДЕ
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.Ссылка = &ГосКонтрактЕИС";
 	
	Запрос.УстановитьПараметр("ГосКонтрактЕИС", ГосударственныйКонтрактЕИС);
	ДанныеГосКонтракта = Запрос.Выполнить().Выгрузить();
	Если НЕ УчетПредметаДоговора Тогда
		ДанныеГосКонтракта.Свернуть("","Количество, Сумма");	
	КонецЕсли;	
	ОбъектыЗакупкиПоКонтрактуЕИС.Загрузить(ДанныеГосКонтракта);
	ТоварыРаботыУслугиИтогВсего = ДанныеГосКонтракта.Итог("Сумма"); 
	ТоварыРаботыУслугиИтогКоличество = ДанныеГосКонтракта.Итог("Количество"); 
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораЭлементов()

	ДопустимыекКФООрганизации = ПолучитьДопустимыеКФООрганизации(Организация, ИФО, ДатаДокумента);
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		СвойстваЛицевогоСчета = ПолучитьСвойстваЛицевогоСчета(ЛицевойСчет, ДатаДокумента);
		Элементы.КФО.СписокВыбора.ЗагрузитьЗначения(СвойстваЛицевогоСчета.КФОпоЛСВнебюджет);	
	Иначе	
		Элементы.КФО.СписокВыбора.ЗагрузитьЗначения(ДопустимыекКФООрганизации.ВыгрузитьЗначения());
	КонецЕсли;	
	Элементы.КФО.СписокВыбора.СортироватьПоЗначению();
	
	ПараметрыВыбораЗначения = Новый Массив;
	МассивВидовПоказателей = Новый Массив;
	МассивВидовПоказателей.Добавить(Перечисления.ВидыКБК.КРБ);
	МассивВидовПоказателей.Добавить(Перечисления.ВидыКБК.КИФ);
	Если НЕ ЭтоБюджетополучатель Тогда
		МассивВидовПоказателей.Добавить(Перечисления.ВидыКБК.Произвольный);
		МассивВидовПоказателей.Добавить(Перечисления.ВидыКБК.АУИБУ);
	КонецЕсли;	
	ПараметрыВыбораЗначения.Добавить(Новый ПараметрВыбора("Отбор.ВидПоказателя", 		Новый ФиксированныйМассив(МассивВидовПоказателей)));
	Если НЕ ЭтоБюджетополучатель Тогда
		МассивУточненияПоказателей = Новый Массив;
		МассивУточненияПоказателей.Добавить(Перечисления.ВидыКБК.ПустаяСсылка());
		МассивУточненияПоказателей.Добавить(Перечисления.ВидыКБК.КРБ);
		МассивУточненияПоказателей.Добавить(Перечисления.ВидыКБК.КИФ);
		ПараметрыВыбораЗначения.Добавить(Новый ПараметрВыбора("Отбор.УточнениеПоказателя", 		Новый ФиксированныйМассив(МассивУточненияПоказателей)));
	КонецЕсли;	
	Элементы.КПС.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЗначения);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоСведениямИзЕИС()
	ВидимостьУчетаПредметаДоговора = Истина;
	Если НЕ УчетПредметаДоговора Тогда
		ВидимостьУчетаПредметаДоговора = Ложь;
	КонецЕсли;	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы,
		"ГруппаУчетПоПредмету", "Видимость", ВидимостьУчетаПредметаДоговора ИЛИ ЗаполнениеСведенийСправочника);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы,
		"ГруппаУчетБезПредмета", "Видимость", НЕ ВидимостьУчетаПредметаДоговора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы,
		"Подразделение", "Видимость", ЕстьПодразделение);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОбщиеРеквизиты",
		"Видимость", НЕ ЗаполнениеСведенийСправочника);
	
КонецПроцедуры	

&НаСервере
Процедура НастройкаИнтерфейсаФормы()
	Если ЗаполнениеСведенийСправочника Тогда
		Элементы.ФормаДобавитьВДокумент.Заголовок = НСтр("ru='Добавить договор и номенклатуру в государственный контракт'");
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокумент = Истина;
		Модифицированность = Истина;
		Закрыть();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеЗаполненияРегистрацииОбязательствВХранилище()
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств = Новый Структура;
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств.Вставить("ПериодПлана", ПериодПлана);
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств.Вставить("КФО", КФО);
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств.Вставить("КПС", КПС);
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств.Вставить("КЭК", КЭК);
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств.Вставить("РазделЛицевогоСчета", РазделЛицевогоСчета);
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств.Вставить("Подразделение", Подразделение);
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств.Вставить("ОбъектФАИП", ОбъектФАИП);
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств.Вставить("КодЦели", КодЦели);
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств.Вставить("КодМероприятия", КодМероприятия);
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств.Вставить("ДопКлассификация", ДопКлассификация);
	ОбщиеЗначенияЗаполненияРегистрацииОбязательств.Вставить("ГосударственныйКонтрактЕИС", ГосударственныйКонтрактЕИС);
	
	ДанныеДляЗаполненияРегистрацииОбязательств = Новый Структура;
	ДанныеДляЗаполненияРегистрацииОбязательств.Вставить("ОбъектыЗакупки", ОбъектыЗакупкиПоКонтрактуЕИС.Выгрузить());
	ДанныеДляЗаполненияРегистрацииОбязательств.Вставить("ОбщиеРеквизиты", ОбщиеЗначенияЗаполненияРегистрацииОбязательств);
	
	АдресДанныеЗаполненияОбязательствВХранилище = ПоместитьВоВременноеХранилище(ДанныеДляЗаполненияРегистрацииОбязательств, УникальныйИдентификатор);
	
	Возврат АдресДанныеЗаполненияОбязательствВХранилище;
	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектыЗакупкиПоКонтрактуЕИС(Форма)

	Для Каждого ТекущаяСтрока Из Форма.ОбъектыЗакупкиПоКонтрактуЕИС Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыОбъектыЗакупкиПоКонтрактуЕИС(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыОбъектыЗакупкиПоКонтрактуЕИС(ТекущаяСтрока)

	ТекущаяСтрока.ВЕИСЗаголовок = НСтр("ru = 'В ЕИС:'");
	ТекущаяСтрока.ВОрганизацииЗаголовок = НСтр("ru = 'В организации:'");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДопустимыеКФООрганизации(Организация, ИФО, НаДату)
	
	СписокКФО = Новый СписокЗначений;
	
	СписокКФО.ЗагрузитьЗначения(БухгалтерскийУчетПовтИсп.КФОПоУчетнойПолитике(Организация, ИФО, НаДату)); 
	
	Возврат СписокКФО;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСвойстваЛицевогоСчета(ЛицевойСчет, Период)
	
	СвойстваСчета = ПлатежноРасчетныеДокументыПовтИсп.ПолучитьСвойстваЛицевогоСчета(ЛицевойСчет, Период);
	
	ПлатежноРасчетныеДокументы.ДополнитьСвойстваЛицевогоСчета(ЛицевойСчет, СвойстваСчета);
	
	Возврат СвойстваСчета;
	
КонецФункции

#КонецОбласти
